Reports/ИсторияИзмененийОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ИсторияИзмененийОбъектов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийНомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ВерсииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ВерсииОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВерсияОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвторВерсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВерсии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненоВФайл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ИсторияИзмененийОбъектов/Forms/ФормаОтчетаУпр/Ext/Form/Module.bsl
Процедура СформироватьТаблицуВерсий() Экспорт
	
	СписокВерсий.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Отчет.СсылкаНаОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Отчет.СсылкаНаОбъект);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВерсииОбъектов.НомерВерсии КАК НомерВерсии,
	|	ВерсииОбъектов.АвторВерсии,
	|	ВерсииОбъектов.ДатаВерсии,
	|	ВерсииОбъектов.СохраненоВФайл
	|ИЗ
	|	РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
	|ГДЕ
	|	ВерсииОбъектов.Объект = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерВерсии";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СписокВерсий.Добавить();
		НоваяСтрока.НомерВерсии = Выборка.НомерВерсии;
		НоваяСтрока.АвторВерсии = Выборка.АвторВерсии;
		НоваяСтрока.ДатаВерсии  = Выборка.ДатаВерсии;
		НоваяСтрока.СохраненоВФайл  = Выборка.СохраненоВФайл;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.СсылкаНаОбъект = Параметры.СсылкаНаОбъект;
	Если Параметры.ЗаполнятьСписокВерсий Тогда
		СформироватьТаблицуВерсий();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	Объект = РеквизитФормыВЗначение("Отчет");
	ТабДок = Новый ТабличныйДокумент();
	
	ТекДанные = СписокВерсий.НайтиПоИдентификатору(Элементы.СписокВерсий.ТекущаяСтрока);
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанные.НомерВерсии) Тогда
		Список = Новый СписокЗначений;
		Список.Добавить(ТекДанные.НомерВерсии);
		Объект.СформироватьОтчет(ТабДок, Список);
	Иначе
		Сообщить("Для продолжения необходимо выбрать версию объекта");
	КонецЕсли;
	
	ТЧОтчета.Очистить();
	ТЧОтчета.Вывести(ТабДок);
	
КонецПроцедуры	

&НаКлиенте
Процедура ОткрытьВерсиюОбъекта()
	
	СформироватьОтчетНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаОбъектПриИзменении(Элемент)
	
	СформироватьТаблицуВерсий();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВерсийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СформироватьОтчетНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВерсию(Команда)
	ОткрытьВерсиюОбъекта();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	СформироватьТаблицуВерсий();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСравнение()
	
	Объект = РеквизитФормыВЗначение("Отчет");
	ТабДок = Новый ТабличныйДокумент();
	
	ВыделенныеСтроки = Элементы.СписокВерсий.ВыделенныеСтроки;
	
	Список = Новый СписокЗначений;
	
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		Список.Добавить(СписокВерсий.НайтиПоИдентификатору(ВыделеннаяСтрока).НомерВерсии);
	КонецЦикла;
	
	Если Список.Количество() = 2 Тогда
		Объект.СформироватьОтчет(ТабДок, Список);
	КонецЕсли;
	
	ТЧОтчета.Очистить();
	ТЧОтчета.Вывести(ТабДок);
	
КонецПроцедуры	

&НаКлиенте
Процедура СравнитьВерсии(Команда)
	
	Если Элементы.СписокВерсий.ВыделенныеСтроки.Количество() <> 2 Тогда
		Предупреждение("Для сравнения необходимо выбрать две версии",, "Сравнение версий");
	Иначе
		СформироватьСравнение();
	КонецЕсли;	
	
КонецПроцедуры
